Repository: charlie-xing/ShellPY_macos
Catalog: resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

source: A new update is available
zh_hans: 有新版本
zh_hant: 有新版本

source: Actions
zh_hans: 操作

source: Activate
zh_hans: 激活

source: Active
zh_hans: 活跃

source: Add Knowledge Base
zh_hans: 添加知识库

# add_knowledge_base_hint
source: Click 'Add Knowledge Base' to configure your first knowledge base
zh_hans: 点击'添加知识库'开始配置您的第一个知识库

# add_provider
source: Add AI Service Provider
zh_hans: 添加 AI 服务提供商

source: Adjust Avatar
zh_hans: 调整头像

# ai_acceptance_tooltip
source: AI suggestion acceptance rate
zh_hans: AI候选词采用率

# AI_plugin_helper_window_title
source: AI Plugin Helper
zh_hans: AI插件助手
zh_hant: AI插件助手

# ai_provider
source: AI Service Provider
zh_hans: AI 服务提供商

source: API Configuration
zh_hans: API配置

source: API Endpoint
zh_hans: API 端点

source: API Key
zh_hans: API 密钥

# api_key_info
source: Enter your OpenAI API key to use the embedding service
zh_hans: 请输入您的OpenAI API密钥以使用向量化服务

source: API Key Status
zh_hans: API密钥状态

source: API Settings
zh_hans: API 设置

source: Appearance
zh_hans: 外观

source: Available Models
zh_hans: 可用模型

# available_placeholders
source: Available placeholders: {context}, {query}
zh_hans: 可用占位符：{context}, {query}

source: Basic Information
zh_hans: 基本信息

source: Browse
zh_hans: 浏览

# browse_file
source: Browse for model file
zh_hans: 浏览模型文件

source: Cancel
zh_hans: 取消

source: Cancelled
zh_hans: 已取消

source: Change Avatar
zh_hans: 更换头像

source: chars
zh_hans: 字符

source: Check for updates...
zh_hans: 检查新版本...
zh_hant: 檢查新版本...

# checking_robots
source: Checking robots.txt
zh_hans: 正在检查 robots.txt

source: chunks
zh_hans: 块

source: Clear Data
zh_hans: 清空数据

# clear_data_desc
source: Delete all vectorized data
zh_hans: 删除所有向量化数据

source: Clear History
zh_hans: 清空历史

source: Close Tab
zh_hans: 关闭标签

source: Completing processing
zh_hans: 正在完成处理

source: Configuration
zh_hans: 配置

source: Configuration Preview
zh_hans: 配置预览

source: Configure
zh_hans: 配置

# configure_provider_first
source: Please configure and activate an AI provider first
zh_hans: 请先配置并激活一个 AI 提供商

source: Configured
zh_hans: 已配置

source: Configured Knowledge Bases
zh_hans: 已配置的知识库

source: Configured Providers
zh_hans: 已配置的提供商

source: Confirm
zh_hans: 确认

source: Connecting to API
zh_hans: 正在连接到 API

source: Connection Failed
zh_hans: 连接失败

source: Connection successful!
zh_hans: 连接成功！

source: Connection Test
zh_hans: 连接测试

source: Context Settings
zh_hans: 上下文设置

# context_settings_description
source: Configure how retrieved content is formatted and used
zh_hans: 配置检索内容的格式化和使用方式

source: Context Template
zh_hans: 上下文模板

# context_template_description
source: Template for formatting retrieved context. Use {context} and {query} placeholders.
zh_hans: 格式化检索上下文的模板。使用 {context} 和 {query} 占位符。

source: Crawl Depth
zh_hans: 爬取深度

# crawl_depth_hint
source: Link depth from the starting page
zh_hans: 从起始页面开始的链接深度

source: Crawl Website
zh_hans: 爬取网站

# crawl_website_desc
source: Crawl web pages and build index
zh_hans: 爬取网站页面并建立索引

source: Crawling website...
zh_hans: 正在爬取网站...

# create_configure_kb
source: Create and configure knowledge bases in Settings
zh_hans: 在设置中创建和配置知识库

source: Current Provider
zh_hans: 当前提供商

source: Current Status
zh_hans: 当前状态

source: Dark Mode
zh_hans: 暗黑模式

# days_ago
source: %d days ago
zh_hans: %d天前

source: Delete Knowledge Base
zh_hans: 删除知识库

# delete_knowledge_base_message
source: Are you sure you want to delete knowledge base
zh_hans: 确定要删除知识库

source: Delete provider
zh_hans: 删除提供商

# delete_session
source: Delete
zh_hans: 删除

source: Deploy
zh_hans: 重新部署
zh_hant: 重新部署

# deploy_failure
source: Error occurred. Please check log files
zh_hans: 有错误！请查看日志
zh_hant: 有錯誤！請查看日誌

# deploy_start
source: Deploying Rime input method engine.
zh_hans: 部署输入法引擎…
zh_hant: 部署輸入法引擎…

# deploy_success
source: Squirrel is ready.
zh_hans: 部署完成。
zh_hant: 部署完成。

# deploy_update
source: Deploying Rime for updates.
zh_hans: 更新输入法引擎…
zh_hant: 更新輸入法引擎…

source: Description (Optional)
zh_hans: 描述（可选）

source: documents
zh_hans: 文档

source: Edit Knowledge Base
zh_hans: 编辑知识库

source: Embedding Provider
zh_hans: 向量化提供商

source: Embedding Service
zh_hans: 向量服务

# embedding_settings
source: Embedding Service Settings
zh_hans: 向量服务设置

# embedding_settings_description
source: Configure document vectorization service, supporting OpenAI, local models and other options
zh_hans: 配置文档向量化服务，支持OpenAI、本地模型等多种选择

source: Enable RAG
zh_hans: 启用RAG

# enable_rag_description
source: Use knowledge base content to enhance AI responses
zh_hans: 使用知识库内容增强AI回复

source: Enabled
zh_hans: 启用

source: Enter API endpoint
zh_hans: 请输入API端点

source: Enter API key
zh_hans: 请输入API密钥

# enter_kb_description
source: Enter knowledge base description
zh_hans: 请输入知识库描述

# enter_kb_name
source: Enter knowledge base name
zh_hans: 请输入知识库名称

# enter_prompt
source: Enter your prompt...
zh_hans: 输入您的提示...

source: Enter website URL
zh_hans: 请输入网站地址

# enterprise_api_kb
source: Enterprise API
zh_hans: 企业API

# enterprise_api_kb_desc
source: Connect to enterprise knowledge base API
zh_hans: 连接企业知识库API

source: Excellent match
zh_hans: 极佳匹配

# extensions_hint
source: Separate multiple extensions with commas, e.g.: txt,md,pdf
zh_hans: 用逗号分隔多个扩展名，如：txt,md,pdf

source: Fair match
zh_hans: 一般匹配

source: Fetching document count
zh_hans: 正在获取文档数量

source: Folder Path
zh_hans: 文件夹路径

source: General Settings
zh_hans: 通用设置

# get_openai_key
source: Get OpenAI API Key
zh_hans: 获取OpenAI API密钥

source: Good match
zh_hans: 良好匹配

source: Guest
zh_hans: 访客

source: History
zh_hans: 历史

source: Include Metadata
zh_hans: 包含元数据

# include_metadata_description
source: Show similarity scores in context
zh_hans: 在上下文中显示相似度分数

source: Include Subfolders
zh_hans: 包含子文件夹

source: Index Files
zh_hans: 索引文件

# index_files_desc
source: Scan and index documents in folder
zh_hans: 扫描并索引文件夹中的文档

source: Indexing files...
zh_hans: 正在索引文件...

source: Initializing crawler
zh_hans: 正在初始化爬虫

source: Input Interval
zh_hans: 输入间隔

source: Input Method
zh_hans: 输入法

source: Input Parameters
zh_hans: 输入参数

# interval_hint
source: Time delay between input method updates
zh_hans: 输入法更新之间的时间延迟

# kb_status_disabled
source: Disabled
zh_hans: 已禁用

# kb_status_error
source: Error
zh_hans: 错误

# kb_status_needs_crawling
source: Needs Crawling
zh_hans: 需要爬取

# kb_status_needs_indexing
source: Needs Indexing
zh_hans: 需要索引

# kb_status_needs_sync
source: Needs Sync
zh_hans: 需要同步

# kb_status_not_configured
source: Not Configured
zh_hans: 未配置

# kb_status_processing
source: Processing
zh_hans: 处理中

# kb_status_ready
source: Ready
zh_hans: 就绪

source: Knowledge Base
zh_hans: 知识库

# knowledge_base_description
source: Configure and manage your knowledge bases, supporting local folders, web crawling, and enterprise API
zh_hans: 配置和管理您的知识库，支持本地文件夹、网站爬虫和企业API三种类型

source: Knowledge Base Name
zh_hans: 知识库名称

source: Knowledge Base Settings
zh_hans: 知识库设置

source: Knowledge Base Type
zh_hans: 知识库类型

# knowledge_bases_count
source: knowledge bases
zh_hans: 个知识库

source: KPM
zh_hans: 按键/分

source: Last updated
zh_hans: 最后更新

source: Light Mode
zh_hans: 明亮模式

# local_folder_kb
source: Local Folder
zh_hans: 本地文件夹

# local_folder_kb_desc
source: Index documents from local folders
zh_hans: 索引本地文件夹中的文档

source: Local Model
zh_hans: 本地模型

source: Logs...
zh_hans: 日志...
zh_hant: 日誌...

source: Max Context Length
zh_hans: 最大上下文长度

source: Max Pages
zh_hans: 最大页面数

source: Max Results
zh_hans: 最大结果数

source: Maximum Context Length
zh_hans: 最大上下文长度

# maximum_context_length_description
source: Characters limit for context text
zh_hans: 上下文文本的字符限制

source: Maximum Results
zh_hans: 最大结果数

# maximum_results_description
source: Number of chunks to retrieve
zh_hans: 要检索的块数量

source: messages
zh_hans: 条消息

# mode_agent
source: Agent
zh_hans: 智能体

# mode_bot
source: BOT
zh_hans: 机器人

# mode_chat
source: Chat
zh_hans: 对话

# mode_role
source: Role
zh_hans: 角色

source: Model
zh_hans: 模型

# model_identifier
source: Identifier for the model
zh_hans: 模型标识符

source: Model Name
zh_hans: 模型名称

# model_path_hint
source: Path to your local language model file
zh_hans: 本地语言模型文件的路径

source: Model Selection
zh_hans: 模型选择

source: Model URL
zh_hans: 模型 URL

# models_count
source: models
zh_hans: 个模型

source: No
zh_hans: 否

source: No Active Provider
zh_hans: 没有活跃的提供商

# no_history
source: No history yet
zh_hans: 暂无历史记录

source: No knowledge base selected
zh_hans: 未选择知识库

# no_knowledge_bases
source: No knowledge bases configured
zh_hans: 暂无知识库

source: No matching plugins
zh_hans: 没有匹配的插件

# no_models
source: No models available
zh_hans: 没有可用模型

# no_plugins
source: No plugins found
zh_hans: 未找到插件

# no_providers
source: No providers configured yet
zh_hans: 尚未配置提供商

source: No Ready Knowledge Bases
zh_hans: 没有就绪的知识库

source: None
zh_hans: 无

source: Not Configured
zh_hans: 未配置

source: Plugins
zh_hans: 插件

source: Poor match
zh_hans: 较差匹配

# preview_description
source: Preview of current settings
zh_hans: 当前设置的预览

source: Processing
zh_hans: 处理中

source: Processing cancelled
zh_hans: 处理已取消

source: Processing completed
zh_hans: 处理完成

source: Processing files
zh_hans: 正在处理文件

source: Provider Name
zh_hans: 提供商名称

source: RAG Configuration
zh_hans: RAG配置

source: RAG Settings
zh_hans: RAG设置

# rag_settings_description
source: Configure Retrieval-Augmented Generation for knowledge base integration
zh_hans: 配置检索增强生成以集成知识库

source: Refresh
zh_hans: 刷新

# refresh_models_hint
source: Click 'Refresh' to fetch models from your provider
zh_hans: 点击'刷新'从您的提供商获取模型

source: Requires API Key
zh_hans: 需要API密钥

source: Reset
zh_hans: 重置

source: Reset Configuration
zh_hans: 重置配置

# reset_confirmation_message
source: This will reset all RAG configuration to default values. This action cannot be undone.
zh_hans: 这将重置所有RAG配置为默认值。此操作无法撤销。

# reset_confirmation_title
source: Reset Configuration
zh_hans: 重置配置

# reset_defaults
source: Reset to Defaults
zh_hans: 恢复默认

source: Reset to Default
zh_hans: 重置为默认

source: Respect robots.txt
zh_hans: 遵循robots.txt

source: Rime Wiki...
zh_hans: 在线文档...
zh_hant: 在線文檔...

source: Save
zh_hans: 保存

source: Save Changes
zh_hans: 保存更改

source: Save Settings
zh_hans: 保存设置

source: Scanning folder
zh_hans: 正在扫描文件夹

source: Search plugins...
zh_hans: 搜索插件...

source: Search Settings
zh_hans: 搜索设置

# search_settings_description
source: Configure how content is retrieved from knowledge bases
zh_hans: 配置如何从知识库中检索内容

source: Select
zh_hans: 选择

source: Select folder
zh_hans: 选择文件夹

source: Select knowledge base
zh_hans: 选择知识库

# select_plugin
source: Select a plugin to start
zh_hans: 选择一个插件开始

source: Selected
zh_hans: 已选择

source: Selected Provider
zh_hans: 当前提供商

source: Send
zh_hans: 发送

source: Settings
zh_hans: 设置

source: Settings...
zh_hans: 用户设定...
zh_hant: 用戶設定

source: Similarity Threshold
zh_hans: 相似度阈值

# similarity_threshold_description
source: Minimum similarity score (0.0 - 1.0)
zh_hans: 最小相似度分数 (0.0 - 1.0)

source: Skin Theme
zh_hans: 皮肤主题

source: Squirrel
zh_hans: SHELL拼音
zh_hant: SHELL

source: Starting processing
zh_hans: 开始处理

source: Status
zh_hans: 状态

# supported_extensions
source: Supported File Extensions
zh_hans: 支持的文件扩展名

# switch_to_dark
source: Switch to Dark Mode
zh_hans: 切换到暗黑模式

# switch_to_light
source: Switch to Light Mode
zh_hans: 切换到明亮模式

source: Sync user data
zh_hans: 同步用户数据
zh_hant: 同步用戶資料

source: Sync Data
zh_hans: 同步数据

# sync_data_desc
source: Sync latest data from enterprise API
zh_hans: 从企业API同步最新数据

source: Syncing data...
zh_hans: 正在同步数据...

source: Syncing documents
zh_hans: 正在同步文档

# template_label
source: Template:
zh_hans: 模板：

source: Test Connection
zh_hans: 测试连接

# theme_hint
source: Choose the visual theme for input method interface
zh_hans: 选择输入法界面的视觉主题

source: Timeout (seconds)
zh_hans: 超时时间（秒）

# typing_speed_tooltip
source: Average keystrokes per minute
zh_hans: 平均每分钟按键次数

source: User Name
zh_hans: 用户名

source: Vector Dimension
zh_hans: 向量维度

source: Vectorizing documents
zh_hans: 正在向量化文档

source: vectors
zh_hans: 向量

source: Version [version] is now available
zh_hans: [version] 现已发布
zh_hant: [version] 現已發佈

# web_site_kb
source: Web Site
zh_hans: 网站爬虫

# web_site_kb_desc
source: Crawl and index website content
zh_hans: 爬取网站内容并索引

source: Website URL
zh_hans: 网站地址

source: Yes
zh_hans: 是

source: Yesterday
zh_hans: 昨天
